Repository: BeatEcoprove/beat_ecoprove_backend
Catalog: src/BeatEcoprove.Infrastructure/MultiLanguage/Resources/LanguageResources.*.resx
Languages: pt_pt

# Auth.InvalidAuth
source: Invalid password.
pt_pt: Senha de accesso inválida.

# Brand.MustProvideBrandName
source: Please provide a name for the brand.
pt_pt: Por favor, forneça um nome para a marca.

# Brand.MustProvideBrandAvatar
source: Please provide an avatar for the brand.
pt_pt: Por favor, forneça um avatar para a marca.

# Brand.ThereIsNoBrandName
source: There is no brand with that name.
pt_pt: Não existe nenhuma marca com esse nome.

# Bucket.InvalidClothToAdd
source: No clothes found.
pt_pt: Roupa não encontrada.

# Bucket.EmptyClothIds
source: Please add at least one item to the basket.
pt_pt: Por favor, adiciona pelo menos uma peça ao cesto.

# Bucket.ClothAreNotUnique
source: Please add the garment only once.
pt_pt: Por favor, adicione apenas uma vez a peça de roupa.

# Bucket.CanAddClothToBucket
source: Please, those clothes are already in a basket.
pt_pt: Por favor, essa roupa já está num cesto.

# Bucket.CannotRemoveCloth
source: This item of clothing cannot be removed from the basket.
pt_pt: Não é possível remover esta peça de roupa do cesto.

# Bucket.BucketNameAlreadyUsed
source: Please choose a different name for the basket.
pt_pt: Por favor, escolha um nome diferente para o cesto.

# Bucket.InvalidBucketName
source: Please select a valid name for the basket.
pt_pt: Por favor, escolha um nome válido para o cesto.

# Bucket.BucketDoesNotExists
source: Failing to find the basket.
pt_pt: Falha ao encontrar o cesto.

# Bucket.CannotAccessBucket
source: This basket does not belong to you.
pt_pt: Este cesto não lhe pertence.

# Bucket.NameCannotBeEmpty
source: Please enter a name for the basket.
pt_pt: Por favor preencha um nome para o cesto.

# Cloth.InvalidClothName
source: Please enter a valid name.
pt_pt: Por favor, introduz um nome válido.

# Cloth.ClothNotFound
source: The item you tried to access doesn't exist.
pt_pt: A peça que tentou aceder não existe.

# Cloth.ClothIdBlocked
source: The garment you tried to access is blocked in a transaction.
pt_pt: A peça que tentou aceder está bloqueada numa transação.

# Profile.CannotExchageWithYourSelf
source: It is not possible to trade with the same profile.
pt_pt: Não é possível realizar trocas com o mesmo perfil.

# Cloth.MaintenanceActivityNotFound
source: This garment has no previous maintenance record.
pt_pt: Esta peça não possui nenhum registo de manutenções anteriores.

# Cloth.InvalidClothType
source: Please enter a valid garment type.
pt_pt: Por favor, introduz um tipo de peça válido.

# Cloth.InvalidClothSize
source: Please enter a valid size (xs, s, m, l, xl, xxl).
pt_pt: Por favor, introduz um tamanho válido (xs, s, m, l, xl, xxl).

# Cloth.CannotUseClothOnMaintenaice
source: This garment is under maintenance.
pt_pt: Esta peça está em manutenção.

# Cloth.IsBeingMaintain
source: This garment is already under maintenance.
pt_pt: Esta peça já se encontra em manutenção.

# Cloth.CannotDisposeCloth
source: It is not possible to mark this part because it is not in use.
pt_pt: Não é possível demarcar esta peça, porque não está em uso.

# Cloth.CannotFinishMaintenanceActivity
source: The maintenance task cannot be completed.
pt_pt: Não é possível terminar a terefa de manutenção.

# Cloth.CannotAccessBucket
source: This garment doesn't belong to you.
pt_pt: Esta peça de roupa não lhe pertence.

# Color.MustProvideColor
source: Color not well defined.
pt_pt: Cor mal definida.

# Color.BadHexValue
source: Color not allowed.
pt_pt: Cor não permitida.

# Email.EmptyEmail
source: Please enter an email address.
pt_pt: Por favor, introduza um email.

# Email.InvalidEmail
source: Please enter a valid e-mail address
pt_pt: Por favor, introduza um e-mail válido

# FeedBack.TitleNotDefine
source: Please enter a title.
pt_pt: Por favor, introduza um título.

# FeedBack.DescriptionNotProvided
source: Please enter a description.
pt_pt: Por favor, introduza uma descrição.

# FeedBack.TitleMaxExceeded
source: The title must not exceed 100 characters.
pt_pt: O título não pode exceder os 100 caracteres.

# FeedBack.TitleMinExceeded
source: The title must be at least 5 characters long.
pt_pt: O título tem de ter pelo menos 5 caracteres.

# Filter.Category
source: The category filter is not well defined.
pt_pt: O filtro category está mal definido.

# Filter.Size
source: The filter size is incorrectly set.
pt_pt: O filtro size está mal definido.

# Filter.Order
source: The order filter is not set correctly.
pt_pt: O filtro order está mal definido.

# ForgotPassword.ForgotTokenNotValid
source: The token provided is no longer valid.
pt_pt: O token fornecido já não se encontra válido.

# Group.NotFound
source: The group has not been found.
pt_pt: O grupo não foi encontrado.

# Group.WSNotFound
source: The group has not been found.
pt_pt: O grupo não foi encontrado.

# Group.WSIsntConnected
source: You are not connected to any group.
pt_pt: Não se encontra conectado a nenhum grupo.

# Group.CannotAccess
source: You don't have permissions to access the group.
pt_pt: Não tem permissões para aceder ao grupo.

# Group.MemberNotFound
source: This member does not belong to the group.
pt_pt: Este membro não pertence ao grupo.

# Group.CannotPromoteToSameRole
source: You cannot promote a member to the same post.
pt_pt: Não pode promover um membro para o mesmo cargo.

# Group.DontBelongToGroup
source: You don't belong to this group.
pt_pt: Não pertences a este grupo.

# Group.PermissionNotValid
source: Invalid permission.
pt_pt: Permissão invalida.

# Group.CannotPromoteMember
source: You don't have permission to promote this member.
pt_pt: Não tem permissões para promover este membro.

# Group.CannotPromoteYourself
source: You can't promote yourself
pt_pt: Não pode promover-se a si mesmo

# Group.CannotKickMember
source: It was not possible to remove the member from the group.
pt_pt: Não foi possível remover o membro do grupo.

# Group.MemberAlreadyExists
source: This member already belongs to the group.
pt_pt: Este membro já pertence ao grupo.

# Group.InviteNotFound
source: This invitation doesn't exist.
pt_pt: Este convite não existe.

# Group.InviteAlreadyAccepted
source: This invitation is already used.
pt_pt: Este convite já foi utilizado.

# MaintenanceService.NotFound
source: The selected service does not exist.
pt_pt: O serviço selecionado não existe.

# MaintenanceService-Action.NotFound
source: The selected action does not exist.
pt_pt: A action selecionada não existe.

# Password.EmptyPassword
source: Please enter a password.
pt_pt: Por favor, introduza uma password.

# Password.MustBeBetween6And16
source: The keyword must be between 6 and 16 characters long
pt_pt: A palavra-chave deve ter entre 6 a 16 caracteres

# Password.MustContainAtLeastOnNumber
source: The keyword must contain at least 1 number
pt_pt: A palavra-chave deve conter pelo menos 1 número

# Password.MustContainAtLeastOnCaptialLetter
source: The keyword must contain at least one capital letter
pt_pt: A palavra-chave deve conter pelo menos uma letra maiúscula

# Password.MustContainAtLeastLetter
source: The keyword must contain at least one lowercase letter
pt_pt: A palavra-chave deve conter pelo menos uma letra minúscula

# Phone.EmptyPhone
source: You must enter the code and password.
pt_pt: O código e a palavra-chave devem ser introduzidos.

# Phone.InvalidPhone
source: Please enter a valid country code.
pt_pt: Por favor introduza um código de país válido.

# Phone.MustBeNineLegth
source: The cell phone must have nine digits.
pt_pt: A telemóvel deve ter nove digítos.

# PostalCode.EmptyPostalCode
source: Please enter a postal code.
pt_pt: Por favor, introduza um código postal.

# PostalCode.InvalidPostalCode
source: Please enter a valid postal code
pt_pt: Por favor, introduza um código postal válido

# Profile.CannotFindCloth
source: The garment could not be found.
pt_pt: Não foi possível encontrar a peça de roupa.

# Profile.CannotFindBucket
source: We couldn't find the basket.
pt_pt: Não foi possível encontrar o cesto.

# Profile.CannotConvertNegativeEcoCoins
source: It is not possible to convert a negative number of EcoCoins.
pt_pt: Não é possível converter um número negativo de EcoCoins.

# Profile.NotEnoughEcoCoins
source: You don't have enough EcoCoins.
pt_pt: Não tens EcoCoins suficientes.

# Profile.NotFound
source: The profile could not be found.
pt_pt: Não foi possível encontrar o perfil.

# Token.InvalidRefreshToken
source: The refresh token is invalid.
pt_pt: O token de atualização é inválido.

# User.ProfileDoesNotBelongToAuth
source: This user does not have access to the chosen profile.
pt_pt: Este utilizador não tem acesso ao perfil escolhido.

# User.ProfileDoesNotExists
source: No profile associated with the user was found.
pt_pt: Não foi encontrado nenhum perfil associado ao utilizador.

# User.EmailAlreadyExists
source: This email is already in use.
pt_pt: Este email já se encontra em uso.

# User.UserNameAlreadyExists
source: This username is already in use.
pt_pt: Este nome de utilizador já se encontra em uso.

# User.EmailDoesNotExists
source: This email does not correspond to any user.
pt_pt: Este email não corresponde a nenhum utilizador.

# User.BadCredentials
source: The email or password is wrong.
pt_pt: O email ou a palavra-chave estão erradas.

# User.InvalidUserGender
source: The user's gender is not accepted.
pt_pt: O género do utilizador não é aceite.

# Username.InvalidUsername
source: Please enter a valid username.
pt_pt: Por favor, insira um nome de utilizador válido.
